Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: sleep 30 ms to avoid high cpu usage
fr: Pause 30 ms pour éviter une utilisation élevée du processeur

source: A segment is defined as a curve that connects two consecutive points in the cardinal spline.
fr: Un segment est défini comme une courbe qui relie deux points consécutifs de la spline cardinale.

source: The ending point of each segment is the starting point for the next.
fr: Le point qui termine chaque segment est le point de départ du segment suivant.

source: Search GdipDrawCurve in MSDN Library
fr: Consultez GdipDrawCurve dans la Librairie MSDN.

source: Draws a cardinal spline
fr: Dessine une spline cardinale

source: Array of points that specify the coordinates that the cardinal spline passes through:
fr: Tableau qui spécifie les coordonnées des points par où la spline cardinale doit passer:

source: Search GdipDrawCurve2 in MSDN Library
fr: Consultez GdipDrawCurve2 dans la Librairie MSDN.

source: Draw an ellipse
fr: Dessine une ellipse

source: The X coordinate of the upper left corner of the rectangle that bounds the ellipse
fr: La coordonnée X du coin supérieur gauche du rectangle qui délimite l'ellipse

source: The Y coordinate of the upper left corner of the rectangle that bounds the ellipse
fr: La coordonnée Y du coin supérieur gauche du rectangle qui délimite l'ellipse

source: The width of the rectangle that bounds the ellipse
fr: La largeur du rectangle qui délimite l'ellipse

source: The height of the rectangle that bounds the ellipse
fr: La hauteur du rectangle qui délimite l'ellipse

source: Search GdipDrawEllipse in MSDN Library
fr: Consultez GdipDrawEllipse dans la Librairie MSDN.

source: Draw an Image object
fr: Dessine un objet Image

source: The X coordinate of the upper left corner of the rendered image
fr: La coordonnée X du coin supérieur gauche de l'image

source: The Y coordinate of the upper left corner of the rendered image
fr: La coordonnée Y du coin supérieur gauche de l'image

source: Search GdipDrawImage in MSDN Library
fr: Consultez GdipDrawImage dans la Librairie MSDN.

source: define x and y vector
fr: Définit un vecteur x,y

source: define start coordinate
fr: Définit les coordonnéées de départ

source: draw bitmap to backbuffer
fr: Dessine bitmap dans le backbuffer

source: copy drawn bitmap to graphics handle (GUI)
fr: Copie le bitmap dessinée dans le handle graphique (GUI)

source: add x vector to current x position
fr: Ajoute le x du vecteur au x de la position actuelle

source: add y vector to current y position
fr: Ajoute le y du vecteur à la position y actuelle

source: when x border is reached reverse x vector
fr: Lorsque x bordure est atteint inverse x du vecteur

source: when y border is reached reverse y vector
fr: Quand y de frontière est atteint, inverse y du vecteur

source: sleep 10 ms to avoid high cpu usage
fr: Pause 10 ms pour éviter une utilisation élevée du processeur

source: Draws an image
fr: Dessine une image

source: Pointer to an Image object
fr: Handle de l'objet Image

source: The X coordinate of the upper-left corner of the portion of the source image to be drawn
fr: La coordonnée X du coin supérieur gauche de la portion de l'image source qui doit être dessinée

source: The Y coordinate of the upper-left corner of the portion of the source image to be drawn
fr: La coordonnée Y du coin supérieur gauche de la portion de l'image source qui doit être dessinée

source: The width of the portion of the source image to be drawn
fr: La largeur de l'image source qui doit être dessinée

source: The height of the portion of the source image to be drawn
fr: La hauteur de l'image source qui doit être dessinée

source: [optional]Pointer to an ImageAttributes object that specifies the color and size attributes of the image to be drawn
fr: [optional] Handle de l'objet ImageAttributes qui spécifie les attributs de couleur et de taille de l'image qui doit être dessinée

source: [optional]Unit of measurement:
fr: [optional] Unité de mesure:

source: Search GdipDrawImagePointsRect in MSDN Library
fr: Consultez GdipDrawImagePointsRect dans la Librairie MSDN.

source: Specifies the width of the destination rectangle at which to draw the image
fr: Spécifie la largeur du rectangle de destination dans lequel l'image sera dessinée

source: Specifies the height of the destination rectangle at which to draw the image
fr: Spécifie la hauteur du rectangle de destination dans lequel l'image sera dessinée

source: Search GdipDrawImageRect in MSDN Library
fr: Consultez GdipDrawImageRect dans la Librairie MSDN.

source: sleep 20 ms to avoid high cpu usage
fr: Pause 20 ms pour soulager le CPU

source: Width of the source image
fr: Largeur de l'image source

source: Height of the source image
fr: Hauteur de l'image source

source: The X coordinate of the upper left corner of the destination image
fr: La coordonnée X du coin supérieur gauche de l'image de destination

source: The Y coordinate of the upper left corner of the destination image
fr: La coordonnée Y du coin supérieur gauche de l'image de destination

source: Width of the destination image
fr: Largeur de l'image de destination

source: Height of the destination image
fr: Hauteur de l'image de destination

source: Pointer to an ImageAttributes structure that specifies the color and size attributes of the image to be drawn.
fr: handle sur une structure ImageAttributes qui spécifie les attributs couleur et taille de l'image qui doit être dessinée.

source: The default value is NULL.
fr: La valeur par défaut est NULL.

source: Specifies the unit of measure for the image
fr: Spécifie l'unité de mesure de l'image

source: Search GdipDrawImageRectRect in MSDN Library
fr: Consultez GdipDrawImageRectRect dans la Librairie MSDN.

source: create the color matrix used to adjust the colors of the image
fr: Crée la matrice des couleurs utilisée pour ajuster les couleurs de l'image

source: use translation color matrix to create a blue scaled image
fr: Utilise la traduction matricielle des couleurs pour créer une image bleu écaillée

source: adjust the ImageAttribute color-key color matrix
fr: Régle la couleur-clé de la matrice des couleurs ImageAttribute

source: draw bitmap to backbuffer by halving the width
fr: Dessine le bitmap dans le buffer en réduisant de moitié la largeur

source: Draw a line
fr: Dessine une ligne (segment)

source: The X coordinate of the starting point of the line
fr: La coordonnée X du point de départ de la ligne

source: The Y coordinate of the starting point of the line
fr: La coordonnée Y du point de départ de la ligne

source: The X coordinate of the ending point of the line
fr: La coordonnée X du point final de la ligne

source: The Y coordinate of the ending point of the line
fr: La coordonnée Y du point final de la ligne

source: [optional]Handle to a pen object that is used to draw the arc.
fr: [optional] Handle de l'objet Pen qui sera utilisé pour dessiner la ligne.

source: Search GdipDrawLine in MSDN Library
fr: Voir GdipDrawLine dans la Librairie MSDN.

source: Draw line
fr: Dessine une ligne

source: Draws a sequence of lines and curves defined by a GraphicsPath object
fr: Dessine une séquence de lignes et de courbes définie par un objet GraphicsPath

source: Pointer to a GraphicsPath object that specifies the sequence of lines and curves that make up the
fr: Handle de l'objet GraphicsPath qui spécifie la séquence de lignes et de courbes qui forme le

source: path
fr: chemin graphique

source: Search GdipDrawPath in MSDN Library
fr: Consultez GdipDrawPath dans la Librairie MSDN.

source: Draw a string using path
fr: Dessine une chaîne en utilisant un chemin graphique

source: Create new path object
fr: Crée un objet Path

source: Create font family object
fr: Crée un objet 'famille de polices'

source: Create string bounding rectangle X=0, Y=0
fr: Crée chaîne limitée par un rectangle de X = 0, Y = 0

source: Add the outline of the string to the path
fr: Ajoute le contour de la chaîne au chemin graphique

source: Sets the graphics object rendering quality (antialiasing)
fr: Définit pour l'objet graphique la qualité de rendu antialiasing

source: Fill path to graphics handle (GUI)
fr: Remplit le chemin du handle graphique (GUI)

source: Draw path to graphics handle (GUI)
fr: Dessine le chemin du handle graphique (GUI)

source: Draw a pie
fr: Dessine un secteur d'angle d'ellipse

source: The X coordinate of the upper left corner of the rectangle that bounds the ellipse in which to draw the pie
fr: La coordonnée X du coin supérieur gauche du rectangle qui délimite l'ellipse qui contient le secteur d'angle

source: The Y coordinate of the upper left corner of the rectangle that bounds the ellipse in which to draw the pie
fr: La coordonnée Y du coin supérieur gauche du rectangle qui délimite l'ellipse qui contient le secteur d'angle

source: The width of the rectangle that bounds the ellipse in which to draw the pie
fr: La largeur du rectangle qui délimite l'ellipse qui contient le secteur d'angle

source: The height of the rectangle that bounds the ellipse in which to draw the pie
fr: La hauteur du rectangle qui délimite l'ellipse contient le secteur d'angle

source: The angle, in degrees, between the X axis and the starting point of the arc that defines the pie.
fr: L'angle, en degrés, entre l'axe X et le point de l'arc qui définit le départ du secteur.

source: A positive value specifies clockwise rotation.
fr: Une valeur positive indique une rotation dans le sens horaire.

source: The angle, in degrees, between the starting and ending points of the arc that defines the pie.
fr: L'angle, en degrés, entre les points de départ et de fin de l'arc qui définit le secteur.

source: Search GdipDrawPie in MSDN Library
fr: Consultez GdipDrawPie dans la Librairie MSDN.

source: Draw a polygon
fr: Dessine un polygone

source: Array that specify the vertices of the polygon:
fr: Tableau qui précise les sommets du polygone :

source: [0][0] - Number of vertices
fr: [0][0] - Nombre de sommets

source: [1][0] - Vertice 1 X position
fr: [1][0] - Sommet 1: abscisse X

source: [1][1] - Vertice 1 Y position
fr: [1][1] - Sommet 1: ordonnée Y

source: [2][0] - Vertice 2 X position
fr: [2][0] - Sommet 2: abscisse X

source: [2][1] - Vertice 2 Y position
fr: [2][1] - Sommet 2: ordonnée Y

source: [n][0] - Vertice n X position
fr: [n][0] - Sommet n: abscisse X

source: [n][1] - Vertice n Y position
fr: [n][1] - Sommet n: ordonnée Y

source: Handle to a pen object that is used to draw the polygon.
fr: Handle de l'objet Pen qui est utilisé pour dessiner le polygone.

source: If the first and last points are not identical, a line is drawn between them to close the polygon.
fr: Si les premier et dernier points ne sont pas identiques, une ligne est tracée entre eux pour fermer le polygone.

source: Search GdipDrawPolygon in MSDN Library
fr: Consultez GdipDrawPolygon dans la Librairie MSDN.

source: draw the triangle
fr: Dessine le triangle

source: Draw a rectangle
fr: Dessine un rectangle

source: The X coordinate of the upper left corner of the rectangle
fr: La coordonnée X du coin supérieur gauche du rectangle

source: The Y coordinate of the upper left corner of the rectangle
fr: La coordonnée Y du coin supérieur gauche du rectangle,

source: The width of the rectangle
fr: La largeur du rectangle

source: The height of the rectangle
fr: La hauteur du rectangle

source: Handle to a pen object that is used to draw the rectangle.
fr: Handle de l'objet Pen qui est utilisé pour dessiner le rectangle.

source: If 0, a solid black pen with a width of 1 will be used
fr: Si 0, un crayon noir qui trace des traits continus de largeur de 1 sera utilisé

source: Search GdipDrawRectangle in MSDN Library
fr: Consultez GdipDrawRectangle dans la Librairie MSDN.

source: String to be drawn
fr: Chaîne à dessiner

source: X coordinate where the string will be drawn
fr: Coordonnée X où la chaîne sera dessinée

source: Y coordinate where the string will be drawn
fr: Coordonnée Y où la chaîne sera dessinée

source: Name of the font to use for drawing
fr: Nom de la police à utiliser pour le dessin

source: Font size to use for drawing
fr: Taille de police à utiliser pour le dessin

source: Format flags.
fr: Indicateurs de formatage.

source: Can be one or more of the following:
fr: Un ou plusieurs des éléments suivants:

source: 0x0001 - Specifies that reading order is right to left
fr: 0x0001 - Indique que l'ordre de lecture est de droite à gauche

source: 0x0002 - Specifies that individual lines of text are drawn vertically on the display device
fr: 0x0002 - Indique que les lignes individuelles de texte sont dessinées verticalement sur le dispositif d'affichage

source: 0x0004 - Specifies that parts of characters are allowed to overhang the string's layout rectangle
fr: 0x0004 - Indique que des caractères sont autorisés à sortir du rectangle de la chaîne

source: 0x0020 - Specifies that Unicode layout control characters are displayed with a representative character
fr: 0x0020 - Indique que les caractères de contrôle Unicode sont affichées avec un caractère représentatif

source: 0x0400 - Specifies that an alternate font is used for characters that are not supported in the requested font
fr: 0x0400 - Indique qu'une autre police peut être utilisée pour les caractères qui ne sont pas pris en charge dans la police demandée

source: 0x0800 - Specifies that the space at the end of each line is included in a string measurement
fr: 0x0800 - Indique que l'espace à la fin de chaque ligne est inclus dans la mesure de la chaîne

source: 0x1000 - Specifies that the wrapping of text to the next line is disabled
fr: 0x1000 - Indique que le passage du texte à la ligne suivante est désactivé

source: 0x2000 - Specifies that only entire lines are laid out in the layout rectangle
fr: 0x2000 - Indique que seules des lignes entières sont affichées dans le rectangle de mise en page

source: 0x4000 - Specifies that characters overhanging the layout rectangle and text extending outside the layout rectangle are allowed to show
fr: 0x4000 - Indique que les caractères sur le cadre du rectangle de mise en page et le texte s'étendant à l'extérieur du rectangle de mise en page sont affichés

source: Handle to the font to use to draw the string
fr: Handle de la police à utiliser pour dessiner la chaîne

source: $tagGDIPRECTF structure that bounds the string
fr: Structure $tagGDIPRECTF qui délimite la chaîne

source: Handle to the string format to draw the string
fr: Handle du format de chaîne pour dessiner la chaîne

source: Handle to the brush to draw the string
fr: Handle du pinceau pour dessiner la chaîne

source: Search GdipDrawString in MSDN Library
fr: Consultez GdipDrawString dans la Librairie MSDN.

source: Fill a closed cardinal spline
fr: Remplit une spline cardinale fermée

source: Handle to a brush object that is used to fill the ellipse.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour remplir la spline.

source: If 0, a black brush will be used.
fr: Si 0, un pinceau noir sera utilisé.

source: Search GdipFillClosedCurve in MSDN Library
fr: Consultez GdipFillClosedCurve dans la Librairie MSDN.

source: Fill a cardinal spline
fr: Remplit une spline cardinale

source: Creates a closed cardinal spline from an array of points and uses a brush to fill the interior of the spline
fr: Crée une spline cardinale fermée à partir d'un tableau de points et utilise un pinceau pour remplir l'intérieur de la spline

source: Array of points that specify the coordinates of the closed cardinal spline:
fr: Tableau de points qui spécifie les coordonnées de la spline cardinale fermée:

source: Number that specifies how tightly the spline bends as it passes through the points
fr: Nombre qui spécifie comment la spline sera tendue sur les points

source: Handle to a brush object that is used to fill the cardinal spline.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour remplir la spline cardinale.

source: Fill mode of the interior of the spline:
fr: Mode de remplissage de l'intérieur de la spline:

source: 0 - The areas are filled according to the even-odd parity rule
fr: 0 - Les zones sont remplis conformément à la règle de parité pair-impair

source: 1 - The areas are filled according to the nonzero winding rule
fr: 1 - Les zones sont remplis selon la règle d'enroulement (winding) non nul

source: Search GdipFillClosedCurve2 in MSDN Library
fr: Consultez GdipFillClosedCurve2 dans la Librairie MSDN.

source: Fill an ellipse
fr: Remplit une ellipse

source: Search GdipFillEllipse in MSDN Library
fr: Consultez GdipFillEllipse dans la Librairie MSDN.

source: Uses a brush to fill the interior of a path
fr: Utilise un pinceau pour remplir l'intérieur d'un chemin graphique (GraphicsPath)

source: Pointer to a GraphicsPath object that specifies the path
fr: Handle de l'objet GraphicsPath qui spécifie le chemin graphique

source: Handle to a Brush object that is used to paint the interior of the path.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour peindre l'intérieur du chemin graphique.

source: If a figure in the path is not closed, this function treats the nonclosed figure as if it were closed by a straight line that connects the figure's starting and ending points.
fr: Si la figure formée par un chemin n'est pas fermée, cette fonction traite la figure non fermée comme si elle était fermée par un segment qui relie les points de début et de fin de la figure.

source: Search GdipFillPath in MSDN Library
fr: Consultez GdipFillPath dans la Librairie MSDN.

source: Fill a pie
fr: Remplit un secteur angulaire

source: Handle to a brush object that is used to fill the pie.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour remplir le secteur angulaire.

source: Search GdipFillPie in MSDN Library
fr: Consultez GdipFillPie dans la Librairie MSDN.

source: Fill a polygon
fr: Remplit un polygone

source: [1][0] - Vertex 1 X position
fr: [1][0] - Sommet 1: abscisse X

source: [1][1] - Vertex 1 Y position
fr: [1][1] - Sommet 1: ordonnée Y

source: [2][0] - Vertex 2 X position
fr: [2][0] - Sommet 2: abscisse X

source: [2][1] - Vertex 2 Y position
fr: [2][1] - Sommet 2: ordonnée Y

source: [n][0] - Vertex n X position
fr: [n][0] - Sommet n: abscisse X

source: [n][1] - Vertex n Y position
fr: [n][1] - Sommet n: ordonnée Y

source: Handle to a brush object that is used to fill the polygon.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour remplir le polygone.

source: Search GdipFillPolygon in MSDN Library
fr: Consultez GdipFillPolygon dans la Librairie MSDN.

source: Fill a rectangle
fr: Remplit un rectangle

source: Handle to a brush object that is used to fill the rectangle.
fr: Handle de l'objet Brush (pinceau) qui est utilisé pour remplir le rectangle.

source: Search GdipFillRectangle in MSDN Library
fr: Consultez GdipFillRectangle dans la Librairie MSDN.

source: Uses a brush to fill a specified region
fr: Utilise un pinceau pour remplir une région déterminée

source: Pointer to a region to be filled
fr: Handle d'une zone à remplir

source: Pointer to a brush that is used to paint the region.
fr: Handle du pinceau qui est utilisé pour peindre la région.

source: Search GdipFillRegion in MSDN Library
fr: Consultez GdipFillRegion dans la Librairie MSDN.

source: Measure first char (0-based)
fr: Mesure le premier caractère (de base 0)

source: One char to measure
fr: Un 'char' à mesurer

source: 5th char
fr: 5-ième 'char'

source: measure 5 chars
fr: mesure 5 caractères

source: 15th char
fr: 15-ième caractère

source: measure 7 chars
fr: mesurer 7 caractères

source: Set ranges
fr: Définit des plages

source: Measure characters fontsize = 14
fr: Mesure des caractères avec la taille des caractères = 14

source: get array of regions
fr: Obtient ensemble des régions

source: Measure characters fontsize = 28
fr: Mesure des caractères avec de taille = 28

source: Measure characters fontsize = 56
fr: Mesure des caractères avec la taille = 56

source: Gets the compositing quality currently set for a Graphics object
fr: Obtient la qualité de composition actuellement installé pour un objet Graphics

source: the compositing quality:
fr: Retourne la qualité de la composition:

source: 0 - Gamma correction is not applied.
fr: 0 - La correction gamma n'est pas appliquée.

source: 1 - Gamma correction is not applied.
fr: 1 - La correction gamma n'est pas appliquée.

source: High speed, low quality.
fr: Grande vitesse, faible qualité.

source: 2 - Gamma correction is applied.
fr: 2 - La correction gamma est appliquée.

source: Composition of high quality and speed.
fr: Composition de haute qualité et de haute rapidité.

source: 3 - Gamma correction is applied.
fr: 3 - La correction gamma est appliquée.

source: 4 - Gamma correction is not applied.
fr: 4 - La correction gamma n'est pas appliquée.

source: Linear values are used.
fr: Des valeurs linéaires sont utilisées.

source: Search GdipGetCompositingQuality in MSDN Library
fr: Consultez GdipGetCompositingQuality dans la Librairie MSDN.

source: Gets a handle to the device context of the Graphics object
fr: Obtient le handle du contexte de périphérique de l'objet Graphics

source: a handle DC of the Graphics object.
fr: Retourne le handle du DC (Device Context)de l'objet Graphics.

source: Each call to the _GDIPlus_GraphicsGetDC() should be paired with a call to the _GDIPlus_GraphicsReleaseDC().
fr: Chaque appel de la fonction _GDIPlus_GraphicsGetDC() devrait être associé à un appel de la fonction _GDIPlus_GraphicsReleaseDC().

source: Do not call any methods of the Graphics object between the calls.
fr: Ne pas appeler de méthode de l'objet Graphics entre les appels.

source: Search GdipGetDC in MSDN Library
fr: Consultez GdipGetDC dans la Librairie MSDN.

source: Gets the interpolation mode currently set for a Graphics object
fr: Obtient le mode d'interpolation actuellement installée pour un objet Graphics

source: the interpolation mode:
fr: Retourne le mode d'interpolation :

source: 0 - Default interpolation mode
fr: 0 - Mode d'interpolation par défaut

source: 1 - Low-quality mode
fr: 1 - Mode basse qualité

source: 2 - High-quality mode
fr: 2 - Mode haute qualité

source: 3 - Bilinear interpolation.
fr: 3 - Interpolation bilinéaire.

source: No prefiltering is done
fr: Aucun pré-filtrage n'est effectué

source: 4 - Bicubic interpolation.
fr: 4 - Interpolation bicubique.

source: 5 - Nearest-neighbor interpolation
fr: 5 - Interpolation proximale (plus proche voisin)

source: 6 - High-quality, bilinear interpolation.
fr: 6 - Haute qualité, interpolation bilinéaire.

source: Prefiltering is performed to ensure high-quality shrinking
fr: Préfiltrage effectué pour assurer la haute qualité d'un rétrécissement d'image

source: 7 - High-quality, bicubic interpolation.
fr: 7 - de haute qualité, interpolation bicubique.

source: Search GdipGetInterpolationMode in MSDN Library
fr: Consultez GdipGetInterpolationMode dans la Librairie MSDN.

source: create a GDI bitmap by capturing whole desktop
fr: Crée un bitmap GDI en capturant l'ensemble du bureau

source: draw captured bitmap to GUI with default system interpolation mode
fr: Dessine le bitmap capturée dans la GUI avec le mode d'interpolation par défaut du système

source: change interpolation mode
fr: change le mode d'interpolation

source: draw again same bitmap but with different interpolation mode
fr: Dessine de nouveau le même bitmap mais avec un mode d'interpolation différent

source: Gets the graphics object rendering quality
fr: Obtient la qualité du rendu de l'objet graphique

source: the smoothing mode.Can be one of the following:
fr: Retourne le mode de lissage, l'un des suivants:

source: 0 - Smoothing is not applied
fr: 0 - Le lissage n'est pas appliqué
